src/cf/Documents/ItobВыбытиеМобильныхУстройств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ItobВыбытиеМобильныхУстройств</Name>
			<BasedOn>
				<xr:Item>Document.ItobПеремещениеМобильногоУстройства</xr:Item>
				<xr:Item>Document.ItobПоступлениеМобильныхУстройств</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ItobПривязкиТрекеров</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОписаниеОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.мкСтатусыРегистрацииМобильныхУстройств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Терминал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ItobТерминалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/InformationRegisters/ItobПривязкиТрекеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ItobПривязкиТрекеров</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТерминалУстановлен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Терминал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ItobТерминалы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ItobОбъектМониторинга</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/мкСтатусыРегистрацииМобильныхУстройств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>мкСтатусыРегистрацииМобильныхУстройств</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Новый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросОтправлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Успешно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отказ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отмена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Documents/ItobВыбытиеМобильныхУстройств/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли; 
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ItobЦентрСпутниковогоМониторинга.МобильныйКлиент") Тогда
		МодульМобильныйКлиентСлужебный = ОбщегоНазначения.ОбщийМодуль("мкМобильныйКлиентСлужебный");		
	    МодульМобильныйКлиентСлужебный.ПроверитьНаНаличиеБолееПозднихДокументовРегистрации(ЭтотОбъект, Отказ);
	КонецЕсли;	
	
	Если Терминал.Модель = ПредопределенноеЗначение("Справочник.ItobМоделиТерминалов.МобильныйКлиент") Тогда
		Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
			Если Не Статус = Перечисления.мкСтатусыРегистрацииМобильныхУстройств.Новый Тогда
				ТекстСообщения = "Данные мобильного клиента отправлены на регистрацию. Отмена проведения документа запрещена.";
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,, Отказ);
			КонецЕсли;
		КонецЕсли;
	Иначе
		Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
			Статус = Перечисления.мкСтатусыРегистрацииМобильныхУстройств.Успешно;
		ИначеЕсли РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
			Статус = Перечисления.мкСтатусыРегистрацииМобильныхУстройств.Новый;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	СтарыйОбъектПривязки = Неопределено;
	Если ОбщегоНазначения.ПодсистемаСуществует("ItobЦентрСпутниковогоМониторинга.МобильныйКлиент") Тогда
		МодульМобильныйКлиентСлужебный = ОбщегоНазначения.ОбщийМодуль("мкМобильныйКлиентСлужебный");		
	    Если Не МодульМобильныйКлиентСлужебный.ОтменаРегистрацииРазрешена(ЭтотОбъект, СтарыйОбъектПривязки) Тогда	
			ТекстСообщения = "Терминал не привязан к объектам мониторинга.";
    		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,, Отказ);
			Возврат;
		КонецЕсли;		
	КонецЕсли;
	
	Если Статус = Перечисления.мкСтатусыРегистрацииМобильныхУстройств.Успешно Тогда
		// регистр ItobПривязкиТрекеров
		Движение = Движения.ItobПривязкиТрекеров.Добавить();
		Движение.Период = Дата;
		Движение.Объект = СтарыйОбъектПривязки;
		Движение.ТерминалУстановлен = Ложь;
		Движение.Терминал = Терминал;
	КонецЕсли;
		
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ItobПеремещениеМобильногоУстройства")
		Или ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ItobПоступлениеМобильныхУстройств") Тогда
		Терминал = ДанныеЗаполнения.Терминал;
		Если КонецДня(ДанныеЗаполнения.Дата) >= КонецДня(ТекущаяДатаСеанса()) Тогда
			Дата = КонецДня(ДанныеЗаполнения.Дата) + 1;
		Иначе
			Дата = ТекущаяДатаСеанса();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
